{
  "backend/main.mo": "Motoko canister managing users, bookings, invoices, profiles, and access control with admin/user permission checks.",
  "feature_evidence.json": "Feature report mapping invoice-related features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of various frontend pages, components, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind theme variables and base styles including light/dark mode tokens and print rules.",
  "frontend/index.html": "HTML entry point loading Inter font and mounting the React app.",
  "frontend/src/App.tsx": "Main router configuration defining layout, routes, and error screens for the app.",
  "frontend/src/components/auth/AdminGate.tsx": "Authorization wrapper that enforces login and admin access before rendering protected content.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and query cache reset.",
  "frontend/src/components/branding/Logo.tsx": "Renders the shop logo with size variants and a fallback text logo if the image fails to load.",
  "frontend/src/components/invoice/InvoiceComposerDialog.tsx": "Dialog for creating invoices with editable line items, discounts, tax, and shareable invoice links.",
  "frontend/src/components/invoice/invoiceMath.ts": "Contains utility functions for calculating invoice subtotal, discount, tax, and total amounts.",
  "frontend/src/components/invoice/InvoiceReceipt.tsx": "Displays a formatted invoice receipt by parsing invoice details and rendering totals and metadata.",
  "frontend/src/components/invoice/LineItemsEditor.tsx": "Provides a UI to add, remove, and edit invoice line items with quantity and price fields.",
  "frontend/src/components/invoice/receiptTheme.ts": "Defines reusable CSS class sets for consistent receipt styling and print visibility helpers.",
  "frontend/src/components/layout/Footer.tsx": "Displays the site footer with shop info, navigation links, contact details, and attribution.",
  "frontend/src/components/layout/Header.tsx": "Renders the main header with logo, navigation links, login button, and a mobile slide-out menu.",
  "frontend/src/components/layout/TopBanner.tsx": "Empty placeholder component file.",
  "frontend/src/components/system/AppErrorBoundary.tsx": "Error boundary component that catches runtime errors and shows an error screen.",
  "frontend/src/components/system/AppErrorScreen.tsx": "Presents a user-friendly error screen with details and a reload button.",
  "frontend/src/constants/shopInfo.ts": "Exports static shop information such as name, phone numbers, and address.",
  "frontend/src/data/galleryItems.tsx": "Defines GalleryItem interface and exports an array of repair service items with metadata and icons.",
  "frontend/src/data/servicesCatalog.tsx": "Defines service catalog categories and lists repair services with descriptions and timing info.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useAuth.ts": "Provides a hook to check if the current authenticated caller is an admin via the actor.",
  "frontend/src/hooks/useBookings.ts": "Implements hooks for creating, updating, and fetching bookings, both admin and public, using the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for managing Internet Identity login, state, and persistence.",
  "frontend/src/hooks/useInvoices.ts": "Implements hooks for managing invoices including create, fetch, mark paid, and public access.",
  "frontend/src/hooks/usePayments.ts": "Fetches all payment instructions from the backend via the actor.",
  "frontend/src/hooks/useReviews.ts": "Hooks for fetching and submitting reviews, sorting results and invalidating cache on updates.",
  "frontend/src/index.css": "Defines Tailwind layers, light/dark theme CSS variables, global base styles, mobile safe-area helpers, dynamic viewport height, and print-specific styles.",
  "frontend/src/main.tsx": "Initializes React root, sets up React Query and Internet Identity providers, and renders the main App component.",
  "frontend/src/pages/AdminBookingsPage.tsx": "Displays all bookings for admins with status management, loading/error states, and invoice generation dialog support.",
  "frontend/src/pages/BookingPage.tsx": "Implements the customer booking form with validation, date/time conversion, and booking submission workflow.",
  "frontend/src/pages/ContactPage.tsx": "Renders contact details including phone numbers, address, directions, and business hours.",
  "frontend/src/pages/GalleryPage.tsx": "Shows a gallery grid of repair items with a dialog for viewing details and images.",
  "frontend/src/pages/InvoiceViewPage.tsx": "Loads and displays a public invoice by ID and access code with print support and error handling.",
  "frontend/src/pages/PaymentsPage.tsx": "Displays available payment methods and dynamically loaded payment instructions using cards and icons.",
  "frontend/src/pages/PublicBookingsPage.tsx": "Shows a public list of bookings with status indicators, loading/error states, and a booking detail dialog.",
  "frontend/src/pages/ReviewsPage.tsx": "Renders customer reviews and provides a form for submitting new reviews with validation and star display.",
  "frontend/src/pages/ServicesPage.tsx": "Lists service categories and individual services via an accordion layout with optional details and a booking CTA.",
  "frontend/src/pages/ShopPage.tsx": "Presents shop information, hero image, contact details, and feature sections with navigation support.",
  "frontend/src/utils/time.ts": "Provides Safari‑safe utilities for formatting timestamps and converting date/time strings to nanoseconds.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash parameters, persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugins.",
  "project_state.json": "Stores the project’s metadata, feature lists, and pending requests for invoice-related functionality."
}