{
  "backend/main.mo": "Motoko backend implementing user profiles, bookings, reviews, and access control with admin checks and public booking creation.",
  "feature_evidence.json": "Feature evidence report listing implemented features, affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files across pages, components, hooks, and data modules.",
  "frontend/index.css": "Tailwind CSS base configuration defining theme variables, dark mode overrides, and global utility application.",
  "frontend/index.html": "HTML entry point loading fonts, metadata, and bootstrapping the React application.",
  "frontend/src/App.tsx": "Main React app defining routes, layout, and theme provider including the new public bookings route.",
  "frontend/src/components/auth/AdminGate.tsx": "Authorization component that enforces login and admin role before rendering protected content with appropriate fallback screens.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and automatic query cache clearing.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with shop info, quick links, contact details, and a dynamic year plus a caffeine.ai attribution link.",
  "frontend/src/components/layout/Header.tsx": "Provides the site header with logo, navigation links, a call button, and a responsive mobile menu using a sheet drawer.",
  "frontend/src/constants/shopInfo.ts": "Exports static shop metadata including name, phone numbers, and address.",
  "frontend/src/data/galleryItems.tsx": "Defines a list of gallery items with titles, descriptions, icons, and optional details for repair services.",
  "frontend/src/data/servicesCatalog.tsx": "Provides categorized service definitions including IDs, descriptions, estimated times, and icons.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on user identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Checks whether the current caller is an admin using the actor and identity hooks.",
  "frontend/src/hooks/useBookings.ts": "Exposes hooks for creating, retrieving, updating, and publicly accessing bookings through the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/usePayments.ts": "Defines a React Query hook that fetches all payment instructions from the backend actor.",
  "frontend/src/hooks/useReviews.ts": "Implements hooks to fetch sorted reviews and submit new reviews, with cache invalidation on submit.",
  "frontend/src/index.css": "Configures Tailwind base styles and defines light/dark theme CSS variables for the app.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminBookingsPage.tsx": "Admin page to view, filter, and update booking statuses with UI components and loading/error states.",
  "frontend/src/pages/BookingPage.tsx": "Booking form page that validates input, submits new bookings, and displays a confirmation screen.",
  "frontend/src/pages/ContactPage.tsx": "Displays shop contact information, location, phone numbers, and business hours using styled UI components.",
  "frontend/src/pages/GalleryPage.tsx": "Displays a gallery grid of images or icons with a detail dialog for viewing full descriptions. Uses GALLERY_ITEMS and supports item selection via modal.",
  "frontend/src/pages/PaymentsPage.tsx": "Shows available payment methods and loads payment instructions from an API with skeleton loading states. Includes a styled header and method cards.",
  "frontend/src/pages/PublicBookingsPage.tsx": "Fetches and displays public bookings with status indicators, loading/error states, and a dialog for viewing booking details. Supports selection of a booking by ID.",
  "frontend/src/pages/ReviewsPage.tsx": "Displays customer reviews and provides a form for submitting new reviews with validation and toast feedback. Shows star ratings and handles API submission.",
  "frontend/src/pages/ServicesPage.tsx": "Presents an accordion of service categories and their services from SERVICES_CATALOG. Includes a CTA card encouraging users to book a repair.",
  "frontend/src/pages/ShopPage.tsx": "React page rendering the shop’s hero image, contact bar, and about section using SHOP_INFO data and UI components.",
  "frontend/src/utils/time.ts": "Provides helpers to format bigint nanosecond timestamps and convert date/time strings into nanoseconds.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL parameters with sessionStorage support, including hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theming, colors, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Project metadata describing features, requirements, state version, and image update instructions."
}