{
  "backend/main.mo": "Motoko canister managing user profiles, bookings, and reviews with access control and CRUD operations.",
  "feature_evidence.json": "Feature evidence report listing UI update requirements and associated frontend files.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend files and pages.",
  "frontend/index.css": "Global Tailwind-based style definitions including custom color variables and dark mode tokens.",
  "frontend/index.html": "Base HTML template loading fonts, metadata, root container, and main React script.",
  "frontend/src/App.tsx": "Main React router setup defining all routes and shared layout with header, footer, and theme provider.",
  "frontend/src/components/auth/AdminGate.tsx": "Authorization guard that checks Internet Identity login and admin status before rendering protected content.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication with loading and error recovery logic.",
  "frontend/src/components/branding/Logo.tsx": "Logo component displaying the shop logo with fallback text rendering on image load failure.",
  "frontend/src/components/layout/Footer.tsx": "Footer component showing shop info, quick links, contact details, and a branded copyright section.",
  "frontend/src/components/layout/Header.tsx": "Header with logo, navigation, call button, and mobile menu using a sheet drawer.",
  "frontend/src/constants/shopInfo.ts": "Static shop information object with name, phone numbers, and address.",
  "frontend/src/data/galleryItems.tsx": "Gallery item definitions containing IDs, descriptions, images, icons, and detailed feature lists.",
  "frontend/src/data/servicesCatalog.tsx": "Service catalog organized by categories, each listing related repair services with descriptions and estimated times.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAuth.ts": "Hook to check whether the current caller is an admin using the backend actor.",
  "frontend/src/hooks/useBookings.ts": "Hooks for creating, fetching, updating, and publicly retrieving bookings through the backend actor with React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, exposing identity, login, logout, and status flags.",
  "frontend/src/hooks/usePayments.ts": "Defines a React Query hook to fetch all payment instructions from the backend actor.",
  "frontend/src/hooks/useReviews.ts": "Implements hooks to fetch and sort reviews and submit new reviews, with cache invalidation via React Query.",
  "frontend/src/index.css": "Tailwind CSS setup defining base theme variables and dark mode styles with an amber/orange color scheme.",
  "frontend/src/main.tsx": "App entry point initializing React Query and wrapping the app with InternetIdentityProvider.",
  "frontend/src/pages/AdminBookingsPage.tsx": "Admin page for listing bookings, viewing details, and updating booking statuses with UI feedback and dialogs.",
  "frontend/src/pages/BookingPage.tsx": "Customer booking form handling validation, submission, and success confirmation, integrated with identity and backend booking API.",
  "frontend/src/pages/ContactPage.tsx": "Displays shop contact information including phone numbers, location, and business hours with styled UI cards.",
  "frontend/src/pages/GalleryPage.tsx": "Displays a grid of gallery items with images, badges, and a dialog for viewing item details.",
  "frontend/src/pages/PaymentsPage.tsx": "Shows available payment methods and loads payment instructions from the backend with a loading state.",
  "frontend/src/pages/PublicBookingsPage.tsx": "Fetches and displays all public bookings with status indicators, error handling, and a booking detail dialog.",
  "frontend/src/pages/ReviewsPage.tsx": "Lists customer reviews and provides a form with validation for submitting new reviews.",
  "frontend/src/pages/ServicesPage.tsx": "Presents service categories and their services in an accordion layout with a call‑to‑action section.",
  "frontend/src/pages/ShopPage.tsx": "Page component rendering the shop’s hero image, contact bar, and main shop info using SHOP_INFO and UI components.",
  "frontend/src/utils/time.ts": "Utilities for converting between bigint nanosecond timestamps and formatted date-time strings.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters with sessionStorage fallback and hash routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, fonts, animations, plugins, and container settings.",
  "project_state.json": "Project metadata summarizing app goals, features, issues, and versioning for the mobile repair service app."
}