{
  "backend/main.mo": "Main Motoko actor defining booking management system with access control, user profiles, bookings (create, get, update status, track by phone), reviews, and payment methods. Includes authorization mixins and role-based permissions for admin and user operations.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: PublicBookingsPage displaying all bookings for a searched phone number, and useCustomerBookings React hook for fetching bookings by phone number using React Query.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including pages (Shop, Services, Gallery, Booking, Admin), components (Header, Footer, Auth), hooks (useBookings with useCustomerBookings, useAuth, usePayments), utilities, and data structures.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, and sidebar components.",
  "frontend/index.html": "HTML entry point with SEO meta tags for Rconnect mobile repair services, Inter font preconnect links, and root div for React mounting.",
  "frontend/src/App.tsx": "Main React app with TanStack Router setup defining routes for shop, services, gallery, booking, contact, reviews, track bookings, and admin bookings, wrapped in ThemeProvider with shared Layout component and error handling.",
  "frontend/src/components/auth/AdminGate.tsx": "Authorization guard component that sequences authentication checks, waits for actor initialization, and displays loading/login/access-denied states before rendering protected admin content.",
  "frontend/src/components/auth/LoginButton.tsx": "Reusable login/logout button using Internet Identity with loading states, query cache clearing on logout, and error handling for duplicate authentication attempts.",
  "frontend/src/components/booking/BookingDetailDialog.tsx": "Dialog component displaying detailed booking information including customer details, device info, appointment time, and status with optional admin status update functionality.",
  "frontend/src/components/branding/Logo.tsx": "Logo component that displays the shop logo image with fallback to a text-based logo if the image fails to load, supporting header and hero variants.",
  "frontend/src/components/invoice/InvoiceComposerDialog.tsx": "Empty file for invoice composition dialog component.",
  "frontend/src/components/invoice/invoiceMath.ts": "Empty file for invoice calculation utilities.",
  "frontend/src/components/invoice/InvoiceReceipt.tsx": "Empty file for invoice receipt display component.",
  "frontend/src/components/invoice/LineItemsEditor.tsx": "Empty file for invoice line items editor component.",
  "frontend/src/components/invoice/receiptTheme.ts": "Empty file for receipt styling and theme configuration.",
  "frontend/src/components/layout/Footer.tsx": "Footer component displaying shop information, quick navigation links, contact details, and a caffeine.ai attribution link.",
  "frontend/src/components/layout/Header.tsx": "Sticky header component with logo, desktop navigation menu, mobile sheet menu, and login button.",
  "frontend/src/components/layout/TopBanner.tsx": "Empty file for top banner component.",
  "frontend/src/components/system/AppErrorBoundary.tsx": "React error boundary component that catches errors and displays the AppErrorScreen with error details.",
  "frontend/src/components/system/AppErrorScreen.tsx": "Error screen component displaying an error message, optional details, and a reload button for application errors.",
  "frontend/src/constants/shopInfo.ts": "Constants file exporting shop information including name, phone numbers, and physical address.",
  "frontend/src/data/galleryItems.tsx": "Gallery data defining repair service showcase items with titles, descriptions, images, icons, and service details for display in the gallery section.",
  "frontend/src/data/servicesCatalog.tsx": "Service catalog data defining categorized repair services with descriptions, estimated times, and popularity flags for screen, battery, charging, software, and water damage repairs.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useAuth.ts": "Custom React hook that checks if the current caller is an admin by querying the backend actor, with proper error handling and retry logic.",
  "frontend/src/hooks/useBookings.ts": "Collection of React Query hooks for booking operations including creating bookings, fetching all bookings, updating booking status, tracking bookings, and retrieving customer-specific bookings sorted by timestamp.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useInvoices.ts": "Empty file placeholder for invoice-related hooks.",
  "frontend/src/hooks/usePayments.ts": "Empty file placeholder for payment-related hooks.",
  "frontend/src/hooks/useReviews.ts": "React Query hooks for fetching all reviews sorted by timestamp and submitting new reviews with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom amber/orange theme variables for light and dark modes, iOS safe area support, dynamic viewport height utilities, and print-optimized styles for invoices.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminBookingsPage.tsx": "Admin dashboard page displaying all bookings with status filtering tabs, status update functionality, and detailed booking view dialog with color-coded status badges.",
  "frontend/src/pages/BookingPage.tsx": "Customer-facing booking form page with service category/service selection, device details, date/time picker, form validation, and success confirmation display with booking ID.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact information page with phone numbers, location, business hours, and email in a card-based layout using shop info constants.",
  "frontend/src/pages/GalleryPage.tsx": "Shows a grid gallery of repair work items with click-to-expand dialog functionality, displaying images, titles, descriptions, and badges.",
  "frontend/src/pages/InvoiceViewPage.tsx": "Empty file with no content.",
  "frontend/src/pages/PaymentsPage.tsx": "Empty file with no content.",
  "frontend/src/pages/PublicBookingsPage.tsx": "Public-facing booking tracker that allows customers to search bookings by ID and phone number, view booking details, and see previous bookings.",
  "frontend/src/pages/ReviewsPage.tsx": "Customer reviews page with a form to submit new reviews (name, rating, text) and displays all existing reviews with star ratings and timestamps.",
  "frontend/src/pages/ServicesPage.tsx": "Displays service catalog in an accordion layout organized by categories, showing service details, estimated times, and popular badges with a CTA to book appointments.",
  "frontend/src/pages/ShopPage.tsx": "React component that displays the shop information page with a hero section, contact bar, about section, and shop details including location, hours, and certifications.",
  "frontend/src/utils/time.ts": "Safari-safe date/time utility functions for formatting bigint timestamps and converting date/time strings to nanoseconds for backend compatibility.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container settings, animations, and typography plugins.",
  "project_state.json": "Project state tracking file documenting existing features for customer bookings display and pending feature requests for booking history retrieval."
}