{
  "backend/main.mo": "Motoko canister implementing authorization, user profiles, bookings, and reviews with admin-protected queries and mutable booking state.",
  "feature_evidence.json": "Defines feature evidence metadata linking a layout-banner removal change to affected frontend files and components.",
  "frontend-file-summaries.txt": "Contains pre-generated descriptions of multiple frontend files for documentation or build analysis.",
  "frontend/index.css": "Tailwind base styles and CSS variables defining the app’s OKLCH color theme with light/dark modes.",
  "frontend/index.html": "Root HTML file loading fonts, metadata, and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Configures the TanStack Router, shared layout (Header/Footer), routes, error screens, and theme provider.",
  "frontend/src/components/auth/AdminGate.tsx": "Authorization wrapper that checks Internet Identity authentication and admin role before rendering protected content.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with reactive UI based on authentication state.",
  "frontend/src/components/branding/Logo.tsx": "Logo component rendering the shop logo with a styled fallback if the image fails to load.",
  "frontend/src/components/layout/Footer.tsx": "Footer component showing shop info, quick navigation links, contact details, and attribution.",
  "frontend/src/components/layout/Header.tsx": "Header with logo, navigation links, phone button, and responsive mobile menu.",
  "frontend/src/components/layout/TopBanner.tsx": "Empty file placeholder for a top banner component.",
  "frontend/src/components/system/AppErrorBoundary.tsx": "React error boundary that catches app errors and displays an error screen.",
  "frontend/src/components/system/AppErrorScreen.tsx": "UI component displaying an error message, optional details, and a reload button.",
  "frontend/src/constants/shopInfo.ts": "Static shop information including name, phone numbers, and address.",
  "frontend/src/data/galleryItems.tsx": "Gallery data list describing repair services with images, icons, and details.",
  "frontend/src/data/servicesCatalog.tsx": "Catalog of service categories and individual services with descriptions and metadata.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useAuth.ts": "Hook to check if the current caller is an admin using the backend actor.",
  "frontend/src/hooks/useBookings.ts": "Hooks for fetching, creating, and updating bookings for both admin and public access.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, exposing identity, login, logout, and status helpers.",
  "frontend/src/hooks/usePayments.ts": "Defines a React Query hook that fetches all payment instructions from the backend actor.",
  "frontend/src/hooks/useReviews.ts": "Contains hooks to fetch sorted reviews and submit new reviews, using React Query for caching and mutations.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and utilities including iOS-safe area and dynamic viewport height support.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AdminBookingsPage.tsx": "Admin interface for viewing bookings, handling loading/error states, and updating booking statuses through a modal flow.",
  "frontend/src/pages/BookingPage.tsx": "Customer booking form that validates inputs, converts date/time to nanoseconds, submits a booking, and shows a success screen.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact info, location, and business hours using shop constants and UI components.",
  "frontend/src/pages/GalleryPage.tsx": "Displays a grid of gallery items with images and badges, and opens a dialog showing item details when selected.",
  "frontend/src/pages/PaymentsPage.tsx": "Shows available payment methods and loads dynamic payment instructions with loading and display states.",
  "frontend/src/pages/PublicBookingsPage.tsx": "Lists public bookings with status indicators, loading/error states, and a dialog for booking details.",
  "frontend/src/pages/ReviewsPage.tsx": "Displays customer reviews and includes a form for submitting new reviews with validation and loading states.",
  "frontend/src/pages/ServicesPage.tsx": "Shows a categorized services catalog using accordions and includes a CTA to book a repair.",
  "frontend/src/pages/ShopPage.tsx": "React page rendering a shop hero section, contact bar, and main content with shop info using UI components and SHOP_INFO data.",
  "frontend/src/utils/time.ts": "Provides Safari-safe utilities for formatting dates and converting date/time strings to nanosecond timestamps.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters with hash-routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom colors, animations, and plugins.",
  "project_state.json": "Project metadata describing state, features, and pending requests for the Rconnect project."
}