{
  "kind": "build_request",
  "title": "Replace Rconnect logo with newly uploaded image and add public All Bookings page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Replace the currently used Rconnect logo asset with the newly uploaded image (download-1.webp) while keeping the existing frontend logo path stable at `/assets/generated/rconnect-logo.dim_512x512.png`, so the Header and ShopPage hero continue to render the updated logo without code changes beyond the static asset update.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "YE HI LOGO CHIYE"
        ]
      },
      "acceptanceCriteria": [
        "The file `/assets/generated/rconnect-logo.dim_512x512.png` is updated to match the newly uploaded logo (download-1.webp).",
        "The updated logo renders correctly in the app header (desktop + mobile sheet) and on the Shop page hero section without layout breakage across common viewport sizes."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Add a new public (non-admin) page that shows a read-only list of all submitted bookings visible to everyone (no login required), including a details view per booking. This page must not allow updating booking status.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "OUR EK add karo jismein all booking dikhe SAB KO"
        ]
      },
      "acceptanceCriteria": [
        "A new route/page exists (e.g., `/bookings` or equivalent) that is accessible without Internet Identity login and displays all bookings.",
        "The page supports viewing booking details (dialog or dedicated detail view) and is strictly read-only (no status update controls).",
        "If the backend previously restricted access to all-bookings data, a new backend query method exists that allows fetching all bookings for this public page, and the frontend page uses that method."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Expose the new public All Bookings page in the main navigation so users can easily find it on both desktop navigation and the mobile menu.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "...all booking dikhe SAB KO"
        ]
      },
      "acceptanceCriteria": [
        "A new navigation item (English label) is present in the Header desktop nav and mobile menu that navigates to the public All Bookings page.",
        "Navigation styling remains consistent with the current theme and active-route behavior."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor; add/modify methods within `backend/main.mo` only.",
    "Do not edit files under `frontend/src/components/ui` or any other paths listed as immutable in SYSTEM_CONTEXT.",
    "Do not remove or break the existing admin-only bookings management page at `/admin/bookings` (it must remain admin-protected and retain status update capability)."
  ],
  "nonGoals": [
    "Do not implement real-time updates (no websockets/push).",
    "Do not add third-party authentication providers; Internet Identity remains the only auth option.",
    "Do not add online payment gateway integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": [
      "Replace the logo artwork with the newly uploaded design (rconnect-logo.dim_512x512.png > rconnect-logo.dim_512x512.png)"
    ]
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}