{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Show “Model Name” consistently across booking UI",
  "requirements": [
    {
      "id": "REQ-25",
      "summary": "Rename all booking UI labels from “Device Model” to “Model Name” while continuing to use the existing `deviceModel` value/field everywhere.",
      "acceptanceCriteria": [
        "On the Booking page form (`frontend/src/pages/BookingPage.tsx`), the field label “Device Model” is changed to “Model Name” (and any related helper/validation text uses “Model Name”), while still saving into the existing `deviceModel` field.",
        "In the Public Bookings booking details dialog (`frontend/src/pages/PublicBookingsPage.tsx`), the device section label “Device Model” is changed to “Model Name” and the displayed value remains `booking.deviceModel`.",
        "In the Admin Bookings booking details dialog (`frontend/src/pages/AdminBookingsPage.tsx`), the device section label “Device Model” is changed to “Model Name” and the displayed value remains `selectedBooking.deviceModel`.",
        "No backend schema/types are changed; existing bookings continue to load and display the model name correctly from `deviceModel`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/BookingPage.tsx",
          "operation": "modify",
          "description": "Change the booking form field label from “Device Model” to “Model Name”, and update any related validation/helper text to say “Model Name” while keeping the stored/submitted field as `deviceModel`."
        },
        {
          "path": "frontend/src/pages/PublicBookingsPage.tsx",
          "operation": "modify",
          "description": "In the public booking details dialog, change the device info label from “Device Model” to “Model Name” while continuing to display `booking.deviceModel` as the value."
        },
        {
          "path": "frontend/src/pages/AdminBookingsPage.tsx",
          "operation": "modify",
          "description": "In the admin booking details dialog, change the device info label from “Device Model” to “Model Name” while continuing to display `selectedBooking.deviceModel` as the value."
        }
      ]
    }
  ]
}